<template>
  <v-layout column justify-center align-center>
    <v-flex xs12 sm8 md6>
      <v-card>
        <v-card-title class="headline">
          Система управления правами пользователей
        </v-card-title>
        <v-card-text>
          <h4>
            Задание
          </h4>
          <p>
            Разработать систему управления правами пользователей на выполнение
            операций с объектами в системе.
          </p>
          <hr class="my-3" />
          <h4>
            Описание
          </h4>
          <p>
            Система управления представляет трехзвенное клиент-серверное
            приложение с базой данных на PostgreSQL-сервере, которое
            предназначено для управления правами пользователей на выполнение
            операций со списочными объектами. Реализован веб-сервис для
            подключения веба RESTful (ASP.NET CORE API).
          </p>
          <hr class="my-3" />
          <h4>
            Требования к реализации сценария – модуль управления правами
            пользователя
          </h4>
          <p>
            Права назначаются ролям пользователей. Для каждой роли задаются
            права на выполнение операций со списочными объектами. Список таких
            объектов хранится в одной таблице базы данных. Для примера: список
            абонентов (реквизиты в Приложении 1). Операция представляет
            допустимое действие со списочным объектом. Для примера: добавление
            записи, редактирование записи, просмотр списка, печать списка.
          </p>
          <p>
            Для каждой роли назначается определенный набор прав.
          </p>
          <ul>
            <li>
              Роль 1 - добавление записи, редактирование записи, просмотр списка
            </li>
            <li>
              Роль 2 - редактирование записи, просмотр списка
            </li>
            <li>
              Роль 3 - просмотр списка, печать списка
            </li>
          </ul>
          <p>
            В роли, которым назначены права, включаются конкретные пользователи
            системы.
          </p>
          <p>
            Модуль должен обеспечивать:
          </p>
          <ul>
            <li>
              отображение списка ролей и назначение им прав по описанным выше
              бизнес-правилам
            </li>
            <li>
              отображение списка учетных записей пользователей
            </li>
            <li>
              включение в роли учетных записей пользователей
            </li>
          </ul>
          <hr class="my-3" />
          <h4>
            Требования к реализации сценария – тестовый модуль проверки
            корректности отработки назначенных прав
          </h4>
          <p>
            Пользователь системы должен быть аутентифицирован своей учётной
            записью и авторизован.
          </p>
          <p>
            Модуль должен:
          </p>
          <ul>
            <li>
              отображать список абонентов
            </li>
            <li>
              для каждой операции, на которую назначаются права, на форме должен
              быть создан визуальный элемент, обеспечивающий её вызов: кнопки,
              пункты меню и т.п.
            </li>
            <li>
              в зависимости от прав текущего пользователя для выделенного в
              отображаемом списке объекта визуальные элементы должны быть
              доступны или недоступны для использования
            </li>
          </ul>
          <hr class="my-3" />
          <h4>
            Архитектурные и прочие нефункциональные требования, приветствуется
          </h4>
          <p>
            Бекенд
          </p>
          <ul>
            <li>
              Реализация сервера приложений предпочтительно в виде .NET Core
              (также возможно WCF, Web-сервисы …)
            </li>
            <li>
              В составе серверной части реализуется сервис доступа к данным в
              виде отдельной DLL компоненты который обращается через к СУБД
              (EntityFramework или ADO.Net)
            </li>
            <li>
              Должны использоваться комментарии и обработка ошибок
            </li>
            <li>
              Обработка\логгирование ошибок
            </li>
          </ul>
          <p>
            Фронтенд
          </p>
          <ul>
            <li>
              Реализация таблиц с автоматической асинхронной подгрузкой данных
              по 10 записей, с сервера при достижении последней записи в списке
            </li>
            <li>
              Продуманный роутинг (маршрутизация)
            </li>
            <li>
              Для неавторизованного пользователя отображать только страницу
              авторизации. Доступ по прямым ссылкам к другим страницам запрещен
            </li>
          </ul>
        </v-card-text>
      </v-card>
    </v-flex>
  </v-layout>
</template>
